tenant_isolation_bench/results/raw/wrk2_v1_of_1_baseline_0_1779437883.log
Running 1m test @ http://10.200.1.2:8080/
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.533ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.531ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.54ms  456.74us   3.14ms   67.36%
    Req/Sec   104.54    107.46   333.00     80.30%
  12002 requests in 1.00m, 2.06MB read
Requests/sec:    200.02
Transfer/sec:     35.16KB
Target QPS: 200
Actual QPS: rate
p50: 1555us
p95: 2279us
p99: 2571us
p99.9: 2865us
RESULT target_qps=200 actual_qps=rate p50_us=1555 p95_us=2279 p99_us=2571 p999_us=2865