tenant_isolation_bench/results/raw/wrk2_v1_of_1_baseline_0_1779438681.log
Running 1m test @ http://10.200.1.2:8080/
  2 threads and 100 connections
  Thread calibration: mean lat.: 12.079ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 783.963ms, rate sampling interval: 4497ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   240.51ms  519.32ms   3.27s    91.08%
    Req/Sec   106.37    117.78     1.00k    94.59%
  11877 requests in 1.00m, 2.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 112
Requests/sec:    197.93
Transfer/sec:     34.80KB
Target QPS: 200
Actual QPS: rate
p50: 5903us
p95: 1266687us
p99: 2559999us
p99.9: 3057663us
RESULT target_qps=200 actual_qps=rate p50_us=5903 p95_us=1266687 p99_us=2559999 p999_us=3057663