tenant_isolation_bench/results/raw/wrk2_v1_of_1_baseline_10000_1779440365.log
Running 1m test @ http://10.200.1.2:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  444.93us   2.67ms   67.25%
    Req/Sec       -nan      -nan   0.00      0.00%
  1200 requests in 6.25s, 210.94KB read
Requests/sec:    191.98
Transfer/sec:     33.75KB
Target QPS: 200
Actual QPS: rate
p50: 1247us
p95: 2073us
p99: 2419us
p99.9: 2641us
RESULT target_qps=200 actual_qps=rate p50_us=1247 p95_us=2073 p99_us=2419 p999_us=2641